// Задача 22. Напишите программу, которая принимает на вход число N и выдает таблицу квадратов числа от 1 до N.

Console.Clear();
Console.WriteLine("Введите число: ");
int digit = Convert. ToInt32(Console.ReadLine());
int count = 1;
void Square(int digitl, int count)
{
    while(count1 <= digit1)
    {
        Console.WriteLine($"|{count1} -> {count1 * count1,3}|");
    count1 ++;
    }

}
Square(digit, count);
